;;; packages.el

(package! cal-china-x)
(package! org-superstar)
(package! nov)
(package! powershell)
(package! sis)
(package! denote)
(package! denote-org)
(package! denote-journal)
(package! denote-markdown)
(package! consult-notes
  :recipe (:host github :repo "mclear-tools/consult-notes"))
(package! shell-maker)
(package! acp)
(package! agent-shell)
