;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(package! cal-china-x)
(package! nov)
(package! powershell)
(package! sis)

;; denote
(package! denote)
(package! denote-org)
(package! denote-journal)
(package! denote-markdown)
(package! consult-notes
  :recipe (:host github :repo "mclear-tools/consult-notes"))

;; agent shell
(package! shell-maker)
(package! acp)
(package! agent-shell)

;; performance
(package! gcmh)

(package! ef-themes)

;; writing & display
(package! olivetti)
(package! org-appear
  :recipe (:host github :repo "awth13/org-appear"))
(package! pangu-spacing)
(package! rainbow-identifiers)
(package! spacious-padding)
(package! ultra-scroll
  :recipe (:host github :repo "jdtsmith/ultra-scroll"))
(package! dired-narrow)
